SunCity/src/Documents/ЧекЕГАИС/ЧекЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЧекЕГАИС</name>
  <registerRecords>AccumulationRegister.ОстаткиАлкогольнойПродукцииЕГАИС</registerRecords>
  <attributes>
    <name>ОрганизацияЕГАИС</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьАдресЧекаЕГАИС</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПодписьЧекаЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеЧекаЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтатусОбработки</name>
    <type>
      <types>EnumRef.СтатусыИнформированияЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСмены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧекаККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЧекаЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомерККМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеПроверкиИПодбора</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроверкиИПодбора</name>
    <type>
      <types>EnumRef.СтатусыПроверкиИПодбораИС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>АлкогольнаяПродукция</name>
      <type>
        <types>CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоЕГАИСНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоЕГАИСНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаГосИСНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаГосИСНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АкцизныеМарки</name>
    <attributes>
      <name>КодАкцизнойМарки</name>
      <type>
        <types>DefinedType.КодАкцизнойМарки</types>
      </type>
    </attributes>
    <attributes>
      <name>АкцизнаяМарка</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Справка2</name>
      <type>
        <types>CatalogRef.Справки2ЕГАИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧастичноеВыбытиеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧастичноеВыбытиеВариантУчета</name>
      <type>
        <types>EnumRef.ВариантыУчетаЧастичногоВыбытияИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧастичноеВыбытиеНоменклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧастичноеВыбытиеХарактеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыбытиеБутылки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SunCity/src/CommonModules/ИнтеграцияЕГАИСРТКлиентСервер/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ПроверитьДанныеАлкогольнойПродукции(Форма, ДанныеПродукции, Номенклатура, ТекстСообщения) Экспорт
	
	Если НЕ ДанныеПродукции.ЭтоАлкогольнаяПродукция Тогда
		ТекстСообщения = НСтр("ru = 'Номенклатура %1 не является алкогольной продукцией.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Номенклатура);
		Возврат Ложь;
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.ЧекЕГАИС.Форма.ФормаДокумента" Тогда
		Если НЕ ДанныеПродукции.Маркируемый Тогда
			ТекстСообщения = НСтр("ru = 'Номенклатура %1 не является маркируемой алкогольной продукцией. Для немаркируемой продукции следует использовать акт списания с признаком ""Реализация""'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Номенклатура);
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПараметрыСканированияАкцизнойМарки() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ТекущееПоле"                    , "");
	Результат.Вставить("АдресВХранилище"                , "");
	Результат.Вставить("ОткрытьФормуМножественногоВвода", Ложь);
	Результат.Вставить("ЗапретитьУдалениеМарки"         , Ложь);
	Результат.Вставить("Операция"                       , "Продажа");
	
	Возврат Результат;
	
КонецФункции


Процедура ЗаполнитьКоличествоАкцизныхМарок(РеквизитОбъектаТовары, РеквизитОбъектаАкцизныеМарки) Экспорт
	
	Для Каждого СтрокаТаблицы Из РеквизитОбъектаТовары Цикл
		
		ЗаполнитьКоличествоАкцизныхМарокВСтроке(СтрокаТаблицы, РеквизитОбъектаАкцизныеМарки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКоличествоАкцизныхМарокВСтроке(СтрокаТаблицыТовары, РеквизитОбъектаАкцизныеМарки) Экспорт
	
	Если СтрокаТаблицыТовары = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоискаАМ = Новый Структура("КлючСвязи");
	СтруктураПоискаАМ.КлючСвязи = СтрокаТаблицыТовары.КлючСвязи;
	СтрокиМарок = РеквизитОбъектаАкцизныеМарки.НайтиСтроки(СтруктураПоискаАМ);
	СтрокаТаблицыТовары.КоличествоАкцизныхМарок = СтрокиМарок.Количество();
	
КонецПроцедуры

Процедура УстановитьЗначениеСтатусАкцизныхМарок(РеквизитОбъектаТовары) Экспорт
	
	Для Каждого СтрокаТаблицы Из РеквизитОбъектаТовары Цикл
		
		УстановитьЗначениеСтатусАкцизныхМарокВСтроке(СтрокаТаблицы)
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЗначениеСтатусАкцизныхМарокВСтроке(СтрокаТаблицыТовары) Экспорт
	
	Если СтрокаТаблицыТовары <> Неопределено Тогда
		Если СтрокаТаблицыТовары.НеобходимостьВводаАкцизнойМарки Тогда
			
			Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицыТовары, "СтатусУказанияАкцизныхМарок") Тогда
				Возврат;
			КонецЕсли; 
			
			Если СтрокаТаблицыТовары.Количество = СтрокаТаблицыТовары.КоличествоАкцизныхМарок
				И СтрокаТаблицыТовары.Количество <> 0 Тогда
				СтрокаТаблицыТовары.СтатусУказанияАкцизныхМарок = 1;
			Иначе
				СтрокаТаблицыТовары.СтатусУказанияАкцизныхМарок = 2;
			КонецЕсли;
		Иначе
			СтрокаТаблицыТовары.СтатусУказанияАкцизныхМарок = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьЗначениеСтатусКодовМаркировкиРМК(РеквизитОбъектаТовары, ОперацияСДенежнымиСредствами) Экспорт
	
	Для Каждого СтрокаТаблицы Из РеквизитОбъектаТовары Цикл
		
		УстановитьЗначениеСтатусКодовМаркировкиРМКВСтроке(СтрокаТаблицы, ОперацияСДенежнымиСредствами);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЗначениеСтатусКодовМаркировкиРМКВСтроке(СтрокаТаблицыТовары, ОперацияСДенежнымиСредствами) Экспорт
	
		Если НЕ СтрокаТаблицыТовары.НеобходимостьВводаАкцизнойМарки Тогда
			Если СтрокаТаблицыТовары.НеобходимостьВводаКодаМаркировки Тогда
				
				Если СтрокаТаблицыТовары.КоличествоУпаковок = СтрокаТаблицыТовары.КоличествоКодовМаркировки
					И СтрокаТаблицыТовары.КоличествоУпаковок <> 0 Тогда
					
					СтрокаТаблицыТовары.СтатусУказанияАкцизныхМарок = 1;
					
				Иначе
					
					Если ОперацияСДенежнымиСредствами Тогда 
						СтрокаТаблицыТовары.СтатусУказанияАкцизныхМарок = 0;
					Иначе 
						СтрокаТаблицыТовары.СтатусУказанияАкцизныхМарок = 2;
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				СтрокаТаблицыТовары.СтатусУказанияАкцизныхМарок = 0;
				
			КонецЕсли;
		КонецЕсли;
	
КонецПроцедуры

// Формирует заголовок формы документа ЧекЕГАИС с видом операции вскрытие тары.
//
Процедура УстановитьЗаголовокВскрытиеТары(Форма) Экспорт
	
	Форма.АвтоЗаголовок = Ложь;
	
	Если ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
		Заголовок = НСтр("ru='Вскрытие тары ЕГАИС %1 от %2'");
		Заголовок = СтрШаблон(Заголовок, Форма.Объект.Номер, Форма.Объект.Дата);
	Иначе
		Заголовок = НСтр("ru='Вскрытие тары ЕГАИС (создание)'");
	КонецЕсли;
	
	Форма.Заголовок = Заголовок;
	
КонецПроцедуры

#КонецОбласти
